# Дан список чисел [1,2,3,2,1]. Определите, сколько в нем встречается различных чисел.

l = [1, 2, 3, 2, 1]
ll = set(l)
print(len(ll))

