# Написать функцию, которая принимает 3 списка и возвращает их общую сумму элементов
def l_sum(a, b, c):
    l11 = sum(a)
    l22 = sum(b)
    l33 = sum(c)
    return l11 + l22 + l33

l1 = [1, 2, 3, 4, 6, 8, 5]
l2 = [1, 2, 3, 4, 6, 8, 5]
l3 = [1, 2, 3, 4, 6, 8, 5]

print(l_sum(l1, l2, l3))