# Дано 2 списка int, a и b, длина каждого равна 3.Написать функцию, которая принимает оба
# списка и возвращает новый список длиной 2, содержащий их средние элементы.

def l_c(a, b):
    c.append(a[1])
    c.append(b[1])

a = [2, 6, 4]
b = [6, 12, 8]

c = []

l_c(a, b)
print(c)